app/Controllers/AuthController.php

    public function authenticate()
    {
        $session = session();
        $accountModel = new AccountModel();

        // Get the email and password inputs
        $email = $this->request->getVar('text'); // Assuming 'text' is your email input field
        $password = $this->request->getVar('password');


        // Retrieve user account by email
        $account = $accountModel->getAccountByEmail($email);

        if ($account) {
            // Check hashed password match
            if (password_verify($password, $account['password'])) {
                // Password matches; login the user
                $userModel = new UserModel();
                $user = $userModel->find($account['id_user']); // Fetch user details
---
SELECT *
FROM `user`
WHERE `user`.`id_user` = '2'