app/Controllers/NoteController.php

SELECT *
FROM `module`
WHERE `id_user` = '7'
---
    public function getModuleProf(){
        $session = Session();
        $id = $session->get('id_user');
        $moduleModel = new ModuleModel();
        $modules = $moduleModel->where('id_user', $id)->findAll();