app/Controllers/ReclamationController.php

    public function profReclamation(){
        $session = session();
        $id = $session->get('id_user');

        // Récupérer les modules associés à l'utilisateur
        $moduleModel = new ModuleModel();
        $modules = $moduleModel->where('id_user', $id)->findAll();

        // Extraire les IDs des modules
        $moduleIds = array_column($modules, 'id_module'); // Supposons que la clé primaire est 'id_module'

        // Charger le modèle des réclamations
        $reclamationModel = new ReclamationModel();

        // Récupérer les réclamations avec les jointures
        $reclamations = [];
        if (!empty($moduleIds)) {
            $reclamationModel->select('reclamations.*, user.name as user_name, notes.note as note_value, module.nom_module');
            $reclamationModel->join('user', 'user.id_user = reclamations.id_user'); // Jointure avec la table user
            $reclamationModel->join('notes', 'notes.id_note = reclamations.id_note'); // Jointure avec la table notes
            $reclamationModel->join('module', 'module.id_module = reclamations.id_module'); // Correction ici : 'module' au lieu de 'modules'
            $reclamationModel->whereIn('reclamations.id_module', $moduleIds);
            $reclamationModel->where('reclamations.etat', 'En attent');
            $reclamations = $reclamationModel->findAll();
---
SELECT *
FROM `module`
WHERE `id_user` = '7'
SELECT `reclamations`.*, `user`.`name` as `user_name`, `notes`.`note` as `note_value`, `module`.`nom_module`
FROM `reclamations`
JOIN `user` ON `user`.`id_user` = `reclamations`.`id_user`
JOIN `notes` ON `notes`.`id_note` = `reclamations`.`id_note`
JOIN `module` ON `module`.`id_module` = `reclamations`.`id_module`
WHERE `reclamations`.`id_module` IN ('1','2','3','4','5','6','7','8')
AND `reclamations`.`etat` = 'En attent'