app/Models/AccountModel.php

SELECT *
FROM `account`
WHERE `username` = 'mohammed'
 LIMIT 1
---
    public function getAccountByEmail($email)
    {
        return $this->where('username', $email)->first(); // Retrieve account by email