app/Models/ModuleModel.php

SELECT *
FROM `module`
WHERE `id_module` = '1'
 LIMIT 1
---
    public function getModuleName($id_module) {
        return $this->where('id_module', $id_module)->first();