app/Models/NoteModel.php

    public function getNotesByStudent($id_etudiant) {
        return $this->where('id_user', $id_etudiant)->findAll();
---
SELECT *
FROM `notes`
WHERE `id_user` = '2'