app/Models/ReclamationModel.php

SELECT *
FROM `reclamations`
WHERE `id_user` = '2'
---
    public function getReclamationById_etudiant($id_etu){
        return $this->where('id_user', $id_etu)->findAll();