app/Models/UserModel.php

    public function profileE()
    {
        $session = session();
        if (!$session->get('isLoggedIn')) {
            return redirect()->to(base_url('login')); // Redirect if not logged in
        }
        if ($session->get('role') == 1) {
            $role_name = 'Admin';
        } elseif ($session->get('role') == 2) {
            $role_name = 'Etudiant';
        } elseif ($session->get('role') == 3) {
            $role_name = 'Prof';
        }
        return [
            'name' => $session->get('name'),
            'email' => $session->get('email'),
            'adresse' => $session->get('adresse'),
            'date_birth' => $session->get('date_birth'),
            'id'=>$session->get('id_user'),
            'role' => $role_name,
        ];
---
SELECT *
FROM `user`
WHERE `id_user` = '5'

    public function getUserById($id)
    {
        return $this->db->table('user')
            ->where('id_user', $id)
            ->get()
            ->getRow(); // Returns an object
---
SELECT *
FROM `user`
WHERE `id_user` = '26'